{
  "component-definition": {
    "uuid": "9adbc543-3334-4763-9557-818f16209075",
    "metadata": {
      "title": "Infoblox 7-x DNS V2R1",
      "last-modified": "2022-06-12T11:06:48",
      "version": "2022-06-12T11:06:48",
      "oscal-version": "1.0.0",
      "parties": [
        {
          "uuid": "bc42d3de-04b4-4d78-8740-6a63bdf17916",
          "type": "organization",
          "name": "Example Organization"
        }
      ]
    },
    "components": [
      {
        "uuid": "0a6aaa7e-3847-44f4-86ed-c2eb9079e41e",
        "type": "software",
        "title": "Infoblox 7-x DNS V2R1",
        "description": "Sit quaerat voluptatem sed. Modi sit consectetur modi quisquam labore etincidunt.",
        "responsible-roles": [
          {
            "role-id": "supplier",
            "party-uuids": [
              "bc42d3de-04b4-4d78-8740-6a63bdf17916"
            ]
          }
        ],
        "props": [],
        "control-implementations": [
          {
            "uuid": "49577e5e-0e26-4d6a-a23f-faf65b58a775",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-10.",
            "implemented-requirements": [
              {
                "uuid": "ae4f94ed-a81f-4131-9d8d-64bfe4ac5ac7",
                "description": "Infoblox systems which perform zone transfers to non-Infoblox Grid DNS servers must be configured to limit the number of concurrent sessions for zone transfers.\nThe Infoblox system must limit the number of concurrent client connections to the number of allowed dynamic update clients.",
                "control-id": "ac-10"
              }
            ]
          },
          {
            "uuid": "0fbdacf8-df80-4b06-9970-efd4656427ad",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-9.2.",
            "implemented-requirements": [
              {
                "uuid": "5aee24b6-b743-403d-8609-eb1f9f6c532f",
                "description": "The Infoblox system audit records must be backed up at least every seven days onto a different system or system component than the system or component being audited.",
                "control-id": "au-9.2"
              }
            ]
          },
          {
            "uuid": "7e4a7254-13f3-4aa2-822b-91cd16b30dc7",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-10.1.",
            "implemented-requirements": [
              {
                "uuid": "e126e983-b07c-42bc-90f3-61d584ae3d68",
                "description": "The Infoblox system must be configured to provide the means for authorized individuals to determine the identity of the source of the DNS server-provided information.",
                "control-id": "au-10.1"
              },
              {
                "uuid": "30349cd0-b2e1-486f-9c35-fd08be2e8a30",
                "description": "An Infoblox DNS server must strongly bind the identity of the DNS server with the DNS information using DNSSEC.",
                "control-id": "au-10.1"
              }
            ]
          },
          {
            "uuid": "a5f76b4c-25c1-4813-ab4d-af642f6b264e",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-10.2.",
            "implemented-requirements": [
              {
                "uuid": "f041ecae-b237-4d19-a0be-b0c987fe7d13",
                "description": "The Infoblox system must be configured to validate the binding of the other DNS servers identity to the DNS information for a server-to-server transaction (e.g., zone transfer).",
                "control-id": "au-10.2"
              }
            ]
          },
          {
            "uuid": "3e94a57d-cfda-44a3-9833-ff12201c362f",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-6.",
            "implemented-requirements": [
              {
                "uuid": "c64ca5d2-7a3f-4a33-b303-9a737e8ad342",
                "description": "Primary authoritative name servers must be configured to only receive zone transfer requests from specified secondary name servers.\nThe Infoblox system must be configured to activate a notification to the system administrator when a component failure is detected.\nAn Infoblox DNS server must strongly bind the identity of the DNS server with the DNS information using DNSSEC.\nThe Infoblox system must be configured to provide the means for authorized individuals to determine the identity of the source of the DNS server-provided information.\nThe Infoblox system must be configured to validate the binding of the other DNS servers identity to the DNS information for a server-to-server transaction (e.g., zone transfer).\nRecursion must be disabled on Infoblox DNS servers which are configured as authoritative name servers.\nA DNS server implementation must provide data origin artifacts for internal name/address resolution queries.\nA DNS server implementation must provide data integrity protection artifacts for internal name/address resolution queries.\nThe DNS server implementation must follow procedures to re-role a secondary name server as the master name server should the master name server permanently lose functionality.\nThe Zone Signing Key (ZSK) rollover interval must be configured to less than two months.\nNSEC3 must be used for all internal DNS zones.\nThe Infoblox system must ensure each NS record in a zone file points to an active name server authoritative for the domain specified in that record.\nAll authoritative name servers for a zone must be located on different network segments.\nAn authoritative name server must be configured to enable DNSSEC Resource Records.\nDigital signature algorithm used for DNSSEC-enabled zones must be FIPS-compatible.\nFor zones split between the external and internal sides of a network, the RRs for the external hosts must be separate from the RRs for the internal hosts.\nIn a split DNS configuration, where separate name servers are used between the external and internal networks, the external name server must be configured to not be reachable from inside resolvers.\nIn a split DNS configuration, where separate name servers are used between the external and internal networks, the internal name server must be configured to not be reachable from outside resolvers.\nThe DNS implementation must enforce a Discretionary Access Control (DAC) policy that limits propagation of access rights.\nThe DNS implementation must implement internal/external role separation.\nThe Infoblox system must utilize valid root name servers in the local root zone file.\nThe Infoblox NIOS version must be at the appropriate version.\nThe IP address for hidden master authoritative name servers must not appear in the name servers set in the zone database.\nThe platform on which the name server software is hosted must be configured to respond to DNS traffic only.\nThe platform on which the name server software is hosted must be configured to send outgoing DNS messages from a random port.\nThe private keys corresponding to both the ZSK and the KSK must not be kept on the DNSSEC-aware primary authoritative name server when the name server does not support dynamic updates.\nCNAME records must not point to a zone with lesser security for more than six months.\nThe Infoblox system must be configured in accordance with the security configuration settings based on DoD security configuration or implementation guidance, including STIGs, NSA configuration guides, CTOs, and DTMs.\nThe Infoblox system must be configured to display the appropriate security classification information.\nThe Infoblox system must be configured with the approved DoD notice and consent banner.\nInfoblox Grid configuration must be backed up on a regular basis.\nInfoblox systems must be configured with current DoD password restrictions.\nA secure Out Of Band (OOB) network must be utilized for management of Infoblox Grid Members.\nAll authoritative name servers for a zone must be geographically disbursed.",
                "control-id": "cm-6"
              }
            ]
          },
          {
            "uuid": "46d962ec-76d6-4333-808b-ece8444f23d5",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-7.",
            "implemented-requirements": [
              {
                "uuid": "95104cad-cdd4-498d-bacd-088f272c2ba1",
                "description": "Infoblox systems configured to run the DNS service must be configured to prohibit or restrict unapproved ports and protocols.\nThe DHCP service must not be enabled on an external authoritative name server.",
                "control-id": "cm-7"
              }
            ]
          },
          {
            "uuid": "10d586ae-b8d3-49cb-a595-4e48a2964c4a",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-3.",
            "implemented-requirements": [
              {
                "uuid": "25a1193c-43be-4cfb-9f50-1a6eb3ad74e3",
                "description": "Infoblox systems which are configured to perform zone transfers to non-Grid name servers must utilize transaction signatures (TSIG).",
                "control-id": "ia-3"
              },
              {
                "uuid": "5f740ce3-aa87-4f06-b4ce-a4b72557fa5d",
                "description": "The Infoblox system must authenticate the other DNS server before responding to a server-to-server transaction.",
                "control-id": "ia-3"
              }
            ]
          },
          {
            "uuid": "68112d0b-0b02-481a-9d5e-806a1cc1e2a2",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-3.1.",
            "implemented-requirements": [
              {
                "uuid": "f26182a8-ccd2-43be-b030-d0da20c0a77c",
                "description": "The DNS server implementation must authenticate another DNS server before establishing a remote and/or network connection using bidirectional authentication that is cryptographically based.",
                "control-id": "ia-3.1"
              }
            ]
          },
          {
            "uuid": "ef37481e-bbdc-4453-b791-37116222b3b8",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-5.2.",
            "implemented-requirements": [
              {
                "uuid": "70c20b81-d74d-4863-be96-06414a71c3cf",
                "description": "Only the private key corresponding to the ZSK alone must be kept on the name server that does support dynamic updates.\nSignature generation using the KSK must be done off-line, using the KSK-private stored off-line.",
                "control-id": "ia-5.2"
              }
            ]
          },
          {
            "uuid": "a7e8cab8-0dbb-46bf-8130-860593e3f036",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ma-4.",
            "implemented-requirements": [
              {
                "uuid": "38322f0c-a346-44fd-81f4-a9b9e7f958b2",
                "description": "The Infoblox system must be configured to employ strong authenticators in the establishment of nonlocal maintenance and diagnostic sessions.",
                "control-id": "ma-4"
              }
            ]
          },
          {
            "uuid": "8a352418-4b05-4bce-8f5f-9fe987067225",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-5.1.",
            "implemented-requirements": [
              {
                "uuid": "56b0e6fd-23fd-4c67-b54d-ebbffa68dc20",
                "description": "The Infoblox system must be configured to restrict the ability of individuals to use the DNS server to launch Denial of Service (DoS) attacks against other information systems.",
                "control-id": "sc-5.1"
              }
            ]
          },
          {
            "uuid": "1a778cb9-4609-4092-b60c-5874c30d62a6",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-5.2.",
            "implemented-requirements": [
              {
                "uuid": "150b4062-4248-4c33-9153-71c88efab174",
                "description": "The Infoblox system must be configured to manage excess capacity, bandwidth, or other redundancy to limit the effects of information flooding types of Denial of Service (DoS) attacks.",
                "control-id": "sc-5.2"
              }
            ]
          },
          {
            "uuid": "8482a39a-0423-451c-bead-42a42b838dab",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-8.",
            "implemented-requirements": [
              {
                "uuid": "61021405-e7a7-47af-a057-fcc98282f866",
                "description": "The Infoblox system must be configured to must protect the integrity of transmitted information.",
                "control-id": "sc-8"
              }
            ]
          },
          {
            "uuid": "9e1c91b0-3a6d-4cef-b0b8-28c016bb154c",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-8.1.",
            "implemented-requirements": [
              {
                "uuid": "dece0e14-fb5b-4967-9cd2-27c8f33a735b",
                "description": "The Infoblox system must implement cryptographic mechanisms to detect changes to information during transmission unless otherwise protected by alternative physical safeguards, such as, at a minimum, a Protected Distribution System (PDS).",
                "control-id": "sc-8.1"
              }
            ]
          },
          {
            "uuid": "934491da-a927-40b5-a5cc-56667480ce14",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-8.2.",
            "implemented-requirements": [
              {
                "uuid": "89226125-6ed1-40fa-9e52-78751a25b5d6",
                "description": "The DNS server implementation must maintain the integrity of information during reception.",
                "control-id": "sc-8.2"
              },
              {
                "uuid": "58bd5537-76a1-4d39-8c42-bfa591ec8f1e",
                "description": "The DNS server implementation must maintain the integrity of information during preparation for transmission.",
                "control-id": "sc-8.2"
              }
            ]
          },
          {
            "uuid": "82878031-c04f-4a9e-bbb7-89804c665d2f",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-13.",
            "implemented-requirements": [
              {
                "uuid": "739b1b76-46fb-454b-bada-8f04fddbe32f",
                "description": "The DNS server must implement NIST FIPS-validated cryptography for provisioning digital signatures, generating cryptographic hashes, and protecting unclassified information requiring confidentiality.",
                "control-id": "sc-13"
              }
            ]
          },
          {
            "uuid": "21f3967d-b79f-457a-b2a3-5ab59efe6a95",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-20.",
            "implemented-requirements": [
              {
                "uuid": "fa552967-3c66-4ef1-810d-9e33719a289d",
                "description": "The Infoblox system must be configured to provide additional data origin artifacts along with the authoritative data the system returns in response to external name/address resolution queries.",
                "control-id": "sc-20"
              },
              {
                "uuid": "c9ca751e-d479-46a2-bda1-2deb4d2bab62",
                "description": "A DNS server implementation must provide additional integrity artifacts along with the authoritative name resolution data the system returns in response to external name/address resolution queries.",
                "control-id": "sc-20"
              },
              {
                "uuid": "089f22a5-f8bb-4f8a-a76b-3ee6ed1fe3f2",
                "description": "The Infoblox system implementation must enforce approved authorizations for controlling the flow of information between DNS servers and between DNS servers and DNS clients based on DNSSEC policies.\nA DNS server implementation must provide the means to enable verification of a chain of trust among parent and child domains (if the child supports secure resolution services).",
                "control-id": "sc-20"
              },
              {
                "uuid": "be18496d-ed6b-4df8-8409-d939de32967a",
                "description": "A DNS server implementation must provide the means to indicate the security status of child zones.\nThe Key Signing Key (KSK) rollover interval must be configured to no less than one year.",
                "control-id": "sc-20"
              }
            ]
          },
          {
            "uuid": "b8d592da-04f7-4fcf-8660-949ff92e04e9",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-20.2.",
            "implemented-requirements": [
              {
                "uuid": "78732a16-b9ef-4440-8e43-2a51fa66e92e",
                "description": "A DNS server implementation must provide data integrity protection artifacts for internal name/address resolution queries.",
                "control-id": "sc-20.2"
              },
              {
                "uuid": "eeb7006a-36f6-49fd-b6c4-033975ae09c2",
                "description": "A DNS server implementation must provide data origin artifacts for internal name/address resolution queries.",
                "control-id": "sc-20.2"
              }
            ]
          },
          {
            "uuid": "6c03d1d5-00ac-4a41-9bf8-56b824748c23",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-21.",
            "implemented-requirements": [
              {
                "uuid": "c1f7d2a5-4d8d-4823-b391-6cc7a563eddd",
                "description": "A DNS server implementation must request data integrity verification on the name/address resolution responses the system receives from authoritative sources.",
                "control-id": "sc-21"
              },
              {
                "uuid": "06f5a545-6eb8-498e-b4c7-066112f7ff02",
                "description": "A DNS server implementation must perform data origin verification authentication on the name/address resolution responses the system receives from authoritative sources.",
                "control-id": "sc-21"
              },
              {
                "uuid": "6be323e4-2336-45c5-bf63-8beea6250f70",
                "description": "A DNS server implementation must perform data integrity verification on the name/address resolution responses the system receives from authoritative sources.",
                "control-id": "sc-21"
              },
              {
                "uuid": "6f2310f6-464c-4edd-af95-449d3e4c7391",
                "description": "A DNS server implementation must request data origin authentication verification on the name/address resolution responses the system receives from authoritative sources.",
                "control-id": "sc-21"
              }
            ]
          },
          {
            "uuid": "3a6e8ebb-e230-4085-b009-067d210ac15a",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-23.",
            "implemented-requirements": [
              {
                "uuid": "da58ebce-b437-44fb-8ebe-2ed3c376e59d",
                "description": "Infoblox DNS servers must protect the authenticity of communications sessions for zone transfers.\nInfoblox DNS servers must be configured to protect the authenticity of communications sessions for dynamic updates.\nInfoblox DNS servers must be configured to protect the authenticity of communications sessions for queries.",
                "control-id": "sc-23"
              }
            ]
          },
          {
            "uuid": "b0e9b903-ab4d-4c13-a2fd-648906592860",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-24.",
            "implemented-requirements": [
              {
                "uuid": "aa4d8c7e-4685-41c9-9f06-e45d61d25d09",
                "description": "In the event of a system failure, The Infoblox system must preserve any information necessary to determine cause of failure and any information necessary to return to operations with least disruption to mission processes.",
                "control-id": "sc-24"
              }
            ]
          },
          {
            "uuid": "d68f3f6b-2d9f-40bd-876b-c698dc40e03b",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement si-6.",
            "implemented-requirements": [
              {
                "uuid": "e44034b9-d19e-4b57-b357-ac1830c5d67d",
                "description": "The DNS server implementation must log the event and notify the system administrator when anomalies in the operation of the signed zone transfers are discovered.",
                "control-id": "si-6"
              }
            ]
          },
          {
            "uuid": "df5946dd-278d-4f73-9882-be2d979863a6",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement si-13.4.",
            "implemented-requirements": [
              {
                "uuid": "a1df3b68-badb-4493-8eaa-26bf600764c8",
                "description": "The Infoblox system must be configured to activate a notification to the system administrator when a component failure is detected.",
                "control-id": "si-13.4"
              }
            ]
          },
          {
            "uuid": "a580f9fd-7f77-43fc-a8d6-ab23d14d4715",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement si-17.",
            "implemented-requirements": [
              {
                "uuid": "abf41a1e-34e5-4fa0-a65e-9135a7c6305b",
                "description": "The DNS server implementation must follow procedures to re-role a secondary name server as the master name server should the master name server permanently lose functionality.",
                "control-id": "si-17"
              }
            ]
          }
        ]
      }
    ]
  }
}