{
  "component-definition": {
    "uuid": "743e880c-d167-47cc-a658-3d842330a0d4",
    "metadata": {
      "title": "McAfee Application Control 8-x V2R1",
      "last-modified": "2022-06-12T11:06:48",
      "version": "2022-06-12T11:06:48",
      "oscal-version": "1.0.0",
      "parties": [
        {
          "uuid": "6103e759-dead-4ad6-9f4e-be3ebc80e567",
          "type": "organization",
          "name": "Example Organization"
        }
      ]
    },
    "components": [
      {
        "uuid": "64f38159-f0b5-41cd-8ad1-6a967a3c9e81",
        "type": "software",
        "title": "McAfee Application Control 8-x V2R1",
        "description": "Eius quisquam neque velit dolor quiquia porro. Quiquia adipisci dolorem aliquam. Numquam non aliquam non quaerat.",
        "responsible-roles": [
          {
            "role-id": "supplier",
            "party-uuids": [
              "6103e759-dead-4ad6-9f4e-be3ebc80e567"
            ]
          }
        ],
        "props": [],
        "control-implementations": [
          {
            "uuid": "be821b8f-275f-422f-be85-8f6633b88a6d",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-7.1.",
            "implemented-requirements": [
              {
                "uuid": "641307f6-e3e5-49b6-a827-a02b86c7919b",
                "description": "The Solidcore client Command Line Interface (CLI) must be in lockdown mode.",
                "control-id": "cm-7.1"
              }
            ]
          },
          {
            "uuid": "ee553abb-d6ff-484e-96f8-90aaebd4adb7",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-7.5.",
            "implemented-requirements": [
              {
                "uuid": "3f3584b1-d905-4ec5-854e-2891043ba454",
                "description": "A McAfee Application Control written policy must be documented to outline the organization-specific variables for application whitelisting.\nThe configuration of features under McAfee Application Control Options policies Enforce feature control must be documented in the organizations written policy.\nThe organizations written policy must include a process for how whitelisted applications are deemed to be allowed.\nThe organizations written policy must include procedures for how often the whitelist of allowed applications is reviewed.\nThe Solidcore client must be enabled.\nThe Solidcore client Command Line Interface (CLI) Access Password must be changed from the default.\nThe organization-specific Rules policy must only include executable and dll files that are associated with applications as allowed by the organizations written policy.\nThe McAfee Application Control Options Reputation-Based Execution settings, if enabled, must be configured to allow Most Likely Trusted or Known Trusted only.\nOrganization-specific McAfee Applications Control Options policies must be created and applied to all endpoints.\nThe McAfee Application Control Options policy must be configured to disable Self-Approval.\nThe McAfee Application Control Options policy End User Notification, if configured by organization, must have all default variables replaced with the organization-specific data.\nThe McAfee Application Control Options policies Enforce feature control memory protection must be enabled.\nEnabled features under McAfee Application Control Options policies Enforce feature control must not be configured unless documented in written policy and approved by ISSO/ISSM.\nThe McAfee Application Control Options Inventory option must be configured to hide OS Files.\nThe McAfee Application Control Options Inventory interval option must be configured to pull inventory from endpoints on a regular basis not to exceed seven days.\nThe McAfee Applications Default Rules policy must be part of the effective rules policy applied to every endpoint.\nA copy of the McAfee Default Rules policy must be part of the effective rules policy applied to every endpoint.\nThe organization-specific Rules policies must be part of the effective rules policy applied to all endpoints.\nThe organization-specific Solidcore Client Policies must be created and applied to all endpoints.\nThe Throttling settings must be enabled and configured to settings according to organizations requirements.\nThe Solidcore Client Exception Rules must be documented in the organizations written policy.",
                "control-id": "cm-7.5"
              }
            ]
          },
          {
            "uuid": "2d7c2c27-5937-429b-8fc3-8b2dc841b150",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-5.1.",
            "implemented-requirements": [
              {
                "uuid": "421a0067-ca80-40da-9d95-b5b969af8d7e",
                "description": "The Solidcore client Command Line Interface (CLI) Access password complexity requirements must be documented in the organizations written policy.",
                "control-id": "ia-5.1"
              },
              {
                "uuid": "c069310c-2920-4988-bc72-c1df06d1c6a2",
                "description": "The process by which the Solidcore client Command Line Interface (CLI) Access Password is made available to administrators when needed must be documented in the organizations written policy.",
                "control-id": "ia-5.1"
              },
              {
                "uuid": "09b0ba29-6222-45b0-a355-969e13fad194",
                "description": "The Solidcore client Command Line Interface (CLI) Access Password protection process must be documented in the organizations written policy.",
                "control-id": "ia-5.1"
              },
              {
                "uuid": "8f7b75f1-25ac-4cc8-9576-b9f4a8cdb313",
                "description": "The use of a Solidcore 8.x local Command Line Interface (CLI) Access Password must be documented in the organizations written policy.",
                "control-id": "ia-5.1"
              },
              {
                "uuid": "f29225a4-0701-4f57-ac5a-37577e5361d8",
                "description": "The requirement for scheduled Solidcore client Command Line Interface (CLI) Access Password changes must be documented in the organizations written policy.",
                "control-id": "ia-5.1"
              }
            ]
          },
          {
            "uuid": "4f30d290-041b-4ef3-95ca-a863ca4735c9",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement si-3.",
            "implemented-requirements": [
              {
                "uuid": "78ea9aee-c882-472c-9637-e0b0526f65a7",
                "description": "The McAfee Application Control Options Advanced Threat Defense (ATD) settings, if being used, must be confined to the organizations enclave.\nThe McAfee Application Control Options Reputation setting must be configured to use the McAfee Global Threat Intelligence (McAfee GTI) option.\nThe McAfee Application Control Options Advanced Threat Defense (ATD) settings must not be enabled unless an internal ATD is maintained by the organization.\nThe McAfee Application Control Options Advanced Threat Defense (ATD) settings, if being used, must be configured to send all binaries with a reputation of Might be Trusted and below for analysis.\nThe McAfee Application Control Options Advanced Threat Defense (ATD) settings, if being used, must be configured to only send binaries with a size of 5 MB or less.",
                "control-id": "si-3"
              }
            ]
          }
        ]
      }
    ]
  }
}