{
  "component-definition": {
    "uuid": "1803a73d-0845-42a9-b061-4a02ec5f433b",
    "metadata": {
      "title": "Microsoft Office 365 ProPlus V2R4",
      "last-modified": "2022-06-10T12:50:49",
      "version": "2022-06-10T12:50:49",
      "oscal-version": "1.0.0",
      "parties": [
        {
          "uuid": "2ddf9773-3cca-46c8-9da2-3103956150ac",
          "type": "organization",
          "name": "Example Organization"
        }
      ]
    },
    "components": [
      {
        "uuid": "5cf65da9-f562-4cb0-8437-a20859855441",
        "type": "software",
        "title": "Microsoft Office 365 ProPlus V2R4",
        "description": "Modi dolore dolor quaerat. Est velit non dolor porro labore sed. Numquam eius consectetur dolore consectetur ut labore.",
        "responsible-roles": [
          {
            "role-id": "supplier",
            "party-uuids": [
              "2ddf9773-3cca-46c8-9da2-3103956150ac"
            ]
          }
        ],
        "props": [],
        "control-implementations": [
          {
            "uuid": "6ce4e84e-cc69-4792-b490-34f9a965aed0",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-6.(10).",
            "implemented-requirements": [
              {
                "uuid": "cf645472-5f15-4a02-968f-dc944d6a3247",
                "description": "Users must be prevented from creating new trusted locations in the Trust Center.\nOutlook must be configured to prevent users overriding attachment security settings.",
                "control-id": "ac-6.(10)"
              }
            ]
          },
          {
            "uuid": "901fd7ed-6726-47a4-99a0-8b9ce2128674",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-5.(3).",
            "implemented-requirements": [
              {
                "uuid": "928557a7-8a3c-45b4-bf0c-9587d41370b6",
                "description": "Trust Bar Notifications for unsigned application add-ins in Access must be disabled and blocked.\nTrust Bar notifications must be configured to display information in the Message Bar about the content that has been automatically blocked.\nTrust Bar notification must be enabled for unsigned application add-ins in Excel and blocked.\nProject must automatically disable unsigned add-ins without informing users.\nUnsigned add-ins in PowerPoint must be blocked with no Trust Bar Notification to the user.\nPublisher must automatically disable unsigned add-ins without informing users.\nPublisher must disable all unsigned VBA macros.\nVisio must automatically disable unsigned add-ins without informing users.\nWord must automatically disable unsigned add-ins without informing users.",
                "control-id": "cm-5.(3)"
              }
            ]
          },
          {
            "uuid": "68bbecc4-c1f6-4f5d-8212-c1cb58540ae5",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-6..",
            "implemented-requirements": [
              {
                "uuid": "c21eb30e-bc67-4036-a5f7-18d7c0519dd6",
                "description": "Custom user interface (UI) code must be blocked from loading in all Office applications.\nOffice applications must not load XML expansion packs with Smart Documents.\nThe Local Machine Zone Lockdown Security must be enabled in all Office programs.\nAutoRepublish in Excel must be disabled.\nAutoRepublish warning alert in Excel must be enabled.\nFile extensions must be enabled to match file types in Excel.\nFiles dragged from an Outlook e-mail to the file system must be created in ANSI format.\nJunk e-mail level must be enabled at a setting of High.\nInternet must not be included in Safe Zone for picture download in Outlook.\nThe Publish to Global Address List (GAL) button must be disabled in Outlook.\nThe Outlook Security Mode must be enabled to always use the Outlook Security Group Policy.\nOutlook must be configured to not allow hyperlinks in suspected phishing messages.",
                "control-id": "cm-6."
              }
            ]
          },
          {
            "uuid": "cbd85cfb-fcd5-4e91-946d-f68bb78f22ff",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-7..",
            "implemented-requirements": [
              {
                "uuid": "9335aeb6-84f3-465e-a7dd-38a387ccc5f1",
                "description": "VBA Macros not digitally signed must be blocked in Access.\nThe Office client must be prevented from polling the SharePoint Server for published links.\nVBA Macros not digitally signed must be blocked in Excel.\nVBA Macros not digitally signed must be blocked in Project.\nVBA Macros not digitally signed must be blocked in PowerPoint.\nVBA Macros not digitally signed must be blocked in Visio.\nVBA Macros not digitally signed must be blocked in Word.",
                "control-id": "cm-7."
              }
            ]
          },
          {
            "uuid": "8de68fe1-e1f6-480b-8a58-7590c2a12712",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-3.(1).",
            "implemented-requirements": [
              {
                "uuid": "678f4f19-fb8c-4945-adac-e28a035dff45",
                "description": "The Exchange client authentication with Exchange servers must be enabled to use Kerberos Password Authentication.\nOutlook must use remote procedure call (RPC) encryption to communicate with Microsoft Exchange servers.",
                "control-id": "ia-3.(1)"
              }
            ]
          },
          {
            "uuid": "915fa7d2-d59e-4703-98f8-b665c7a3e981",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-5.(2).",
            "implemented-requirements": [
              {
                "uuid": "67ad3817-76d3-4554-8bce-7309283e76cb",
                "description": "Outlook must be configured to allow retrieving of Certificate Revocation Lists (CRLs) always when online.",
                "control-id": "ia-5.(2)"
              }
            ]
          },
          {
            "uuid": "af7a80e5-8aa7-4008-9e60-7540aef608ae",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-7..",
            "implemented-requirements": [
              {
                "uuid": "2fdde1bd-20e0-41e5-a290-810714bd7851",
                "description": "Consistent MIME handling must be enabled for all Office 365 ProPlus programs.\nThe MIME Sniffing safety feature must be enabled in all Office programs.\nObject Caching Protection must be enabled in all Office programs.",
                "control-id": "ia-7."
              }
            ]
          },
          {
            "uuid": "97324fc3-dff6-4343-9f6d-e47d59810c7f",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-13..",
            "implemented-requirements": [
              {
                "uuid": "03e9ac6a-5576-493d-99f0-f5a79a32ff32",
                "description": "The minimum encryption key length in Outlook must be at least 168.",
                "control-id": "sc-13."
              }
            ]
          },
          {
            "uuid": "d164d483-860d-4838-9513-70eb933181a4",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-18.(1).",
            "implemented-requirements": [
              {
                "uuid": "24c6d885-362b-41b7-a7f4-eeabc1bb52be",
                "description": "Allowing Trusted Locations on the network must be disabled in Access.\nThe Office client must be prevented from polling the SharePoint Server for published links.\nThe load of controls in Forms3 must be blocked.\nAdd-on Management must be enabled for all Office 365 ProPlus programs.\nThe Information Bar must be enabled in all Office programs.\nDynamic Data Exchange (DDE) server launch in Excel must be blocked.\nDynamic Data Exchange (DDE) server lookup in Excel must be blocked.\nOpen/save of dBase III / IV format files must be blocked.\nOpen/save of Dif and Sylk format files must be blocked.\nOpen/save of Excel 2 macrosheets and add-in files must be blocked.\nOpen/save of Excel 2 worksheets must be blocked.\nOpen/save of Excel 3 macrosheets and add-in files must be blocked.\nOpen/save of Excel 3 worksheets must be blocked.\nOpen/save of Excel 4 macrosheets and add-in files must be blocked.\nOpen/save of Excel 4 workbooks must be blocked.\nOpen/save of Excel 4 worksheets must be blocked.\nOpen/save of Excel 95 workbooks must be blocked.\nOpen/save of Excel 95-97 workbooks and templates must be blocked.\nThe default file block behavior must be set to not open blocked files in Excel.\nOpen/save of Web pages and Excel 2003 XML spreadsheets must be blocked.\nExtraction options must be blocked when opening corrupt Excel workbooks.\nWEBSERVICE Function Notification in Excel must be configured to disable all, with notifications.\nUntrusted Microsoft Query files must be blocked from opening in Excel.\nUntrusted database files must be opened in Excel in Protected View mode.\nFiles from Internet zone must be opened in Excel in Protected View mode.\nThe warning about invalid digital signatures must be enabled to warn Outlook users.\nThe ability to demote attachments from Level 2 to Level 1 must be disabled.\nThe display of Level 1 attachments must be disabled in Outlook.\nLevel 1 file attachments must be blocked from being delivered.\nLevel 2 file attachments must be blocked from being delivered.\nThe Security Level for macros in Outlook must be configured to Warn for signed and disable unsigned.\nOpen/Save of PowerPoint 97-2003 presentations, shows, templates, and add-in files must be blocked.\nThe default file block behavior must be set to not open blocked files in PowerPoint.\nFiles downloaded from the Internet must be opened in Protected view in PowerPoint.\nPowerPoint attachments opened from Outlook must be in Protected View.\nFiles in unsafe locations must be opened in Protected view in PowerPoint.\nPublisher must be configured to prompt the user when another application programmatically opens a macro.\nVisio 2000-2002 Binary Drawings, Templates and Stencils must be blocked.\nVisio 2003-2010 Binary Drawings, Templates and Stencils must be blocked.\nVisio 5.0 or earlier Binary Drawings, Templates and Stencils must be blocked.\nFiles downloaded from the Internet must be opened in Protected view in Word.\nFiles located in unsafe locations must be opened in Protected view in Word.\nIf file validation fails, files must be opened in Protected view in Word with ability to edit disabled.\nWord attachments opened from Outlook must be in Protected View.\nThe default file block behavior must be set to not open blocked files in Word.\nOpen/Save of Word 2 and earlier binary documents and templates must be blocked.\nOpen/Save of Word 2000 binary documents and templates must be blocked.\nOpen/Save of Word 2003 binary documents and templates must be blocked.\nOpen/Save of Word 2007 and later binary documents and templates must be blocked.\nOpen/Save of Word 6.0 binary documents and templates must be blocked.\nOpen/Save of Word 95 binary documents and templates must be blocked.\nOpen/Save of Word 97 binary documents and templates must be blocked.\nOpen/Save of Word XP binary documents and templates must be blocked.",
                "control-id": "sc-18.(1)"
              }
            ]
          },
          {
            "uuid": "6bd06f2f-5621-472c-aa07-dc41ba4ceb47",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-18.(3).",
            "implemented-requirements": [
              {
                "uuid": "0a20b26f-626c-430f-a966-b25e509abe6e",
                "description": "Protection from zone elevation must be enabled in all Office programs.\nFile Download Restriction must be enabled in all Office programs.\nScripted Windows Security restrictions must be enabled in all Office programs.\nFile validation in Excel must be enabled.\nFile validation in Word must be enabled.",
                "control-id": "sc-18.(3)"
              }
            ]
          },
          {
            "uuid": "0e6c4bf5-4834-4737-8136-97b15225f69e",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-18.(4).",
            "implemented-requirements": [
              {
                "uuid": "12821e92-faeb-4f9b-b5b0-454e27ea63ce",
                "description": "ActiveX Controls must be initialized in Safe Mode.\nActiveX installation restriction must be enabled in all Office programs.\nFlash player activation must be disabled in all Office programs.\nLoading of pictures from Web pages not created in Excel must be disabled.\nWhen a custom action is executed that uses the Outlook object model, Outlook must automatically deny it.\nWhen an untrusted program attempts to programmatically access an Address Book using the Outlook object model, Outlook must automatically deny it.\nWhen a user designs a custom form in Outlook and attempts to bind an Address Information field to a combination or formula custom field, Outlook must automatically deny it.\nWhen an untrusted program attempts to use the Save As command to programmatically save an item, Outlook must automatically deny it.\nWhen an untrusted program attempts to gain access to a recipient field, such as the, To: field, using the Outlook object model, Outlook must automatically deny it.\nWhen an untrusted program attempts to programmatically send e-mail in Outlook using the Response method of a task or meeting request, Outlook must automatically deny it.\nWhen an untrusted program attempts to send e-mail programmatically using the Outlook object model, Outlook must automatically deny it.",
                "control-id": "sc-18.(4)"
              },
              {
                "uuid": "715913e2-c713-4c13-93e9-1d11a47812b4",
                "description": "Macros must be blocked from running in Access files from the Internet.\nThe Macro Runtime Scan Scope must be enabled for all documents.\nMacros in all Office applications that are opened programmatically by another application must be opened based upon macro security level.\nUser name and password must be disabled in all Office programs.\nNavigate URL must be enabled in all Office programs.\nThe Save from URL feature must be enabled in all Office programs.\nTrusted Locations on the network must be disabled in Excel.\nUpdating of links in Excel must be prompted and not automatic.\nScan of encrypted macros in Excel Open XML workbooks must be enabled.\nMacros must be blocked from running in Excel files from the Internet.\nFiles from unsafe locations must be opened in Excel in Protected View mode.\nFiles failing file validation must be opened in Excel in Protected view mode and disallow edits.\nFile attachments from Outlook must be opened in Excel in Protected mode.\nScripts associated with public folders must be prevented from execution in Outlook.\nScripts associated with shared folders must be prevented from execution in Outlook.\nActive X One-Off forms must only be enabled to load with Outlook Controls.\nOutlook must be configured to not run scripts in forms in which the script and the layout are contained within the message.\nTrusted Locations on the network must be disabled in Project.\nThe ability to run programs from PowerPoint must be disabled.\nEncrypted macros in PowerPoint Open XML presentations must be scanned.\nFile validation in PowerPoint must be enabled.\nMacros from the Internet must be blocked from running in PowerPoint.\nIf file validation fails, files must be opened in Protected view in PowerPoint with ability to edit disabled.\nThe use of network locations must be ignored in PowerPoint.\nTrusted Locations on the network must be disabled in Visio.\nMacros must be blocked from running in Visio files from the Internet.\nIn Word, encrypted macros must be scanned.\nIn Word, macros must be blocked from running, even if Enable all macros is selected in the Macro Settings section of the Trust Center.\nTrusted Locations on the network must be disabled in Word.",
                "control-id": "sc-18.(4)"
              }
            ]
          },
          {
            "uuid": "a6175528-418a-4244-9448-512c0fbf712f",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-23..",
            "implemented-requirements": [
              {
                "uuid": "bf1ea47c-0810-4db4-9811-610cc95e085d",
                "description": "The SIP security mode in Lync must be enabled.\nThe HTTP fallback for SIP connection in Lync must be disabled.",
                "control-id": "sc-23."
              }
            ]
          },
          {
            "uuid": "1ef9535d-6020-4f0a-97a1-dc99f8d6ffd5",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-28..",
            "implemented-requirements": [
              {
                "uuid": "32f634d8-a0a9-41db-8c71-ea5d1191ade3",
                "description": "Office applications must be configured to specify encryption type in password-protected Office 97-2003 files.\nOffice applications must be configured to specify encryption type in password-protected Office Open XML files.",
                "control-id": "sc-28."
              }
            ]
          },
          {
            "uuid": "35adc413-4e6f-4fbd-ba28-bdb66261082e",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-28.(1).",
            "implemented-requirements": [
              {
                "uuid": "03ffe783-9107-45ee-b971-0d99bd920e8a",
                "description": "Document metadata for rights managed Office Open XML files must be protected.",
                "control-id": "sc-28.(1)"
              }
            ]
          }
        ]
      }
    ]
  }
}