{
  "component-definition": {
    "uuid": "3d27225e-0c5e-49a1-bf83-d11817675a09",
    "metadata": {
      "title": "SDN NV V1R1",
      "last-modified": "2022-06-10T12:50:51",
      "version": "2022-06-10T12:50:51",
      "oscal-version": "1.0.0",
      "parties": [
        {
          "uuid": "a9e0d682-5f9d-4140-a108-db833ff771a0",
          "type": "organization",
          "name": "Example Organization"
        }
      ]
    },
    "components": [
      {
        "uuid": "f6f06f7a-39a8-4d0d-9cb5-c113bd869a0a",
        "type": "software",
        "title": "SDN NV V1R1",
        "description": "Labore dolore quaerat sed.",
        "responsible-roles": [
          {
            "role-id": "supplier",
            "party-uuids": [
              "a9e0d682-5f9d-4140-a108-db833ff771a0"
            ]
          }
        ],
        "props": [],
        "control-implementations": [
          {
            "uuid": "798db0c8-e9d6-4255-ba9c-28daadd12f3c",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-3.(2).",
            "implemented-requirements": [
              {
                "uuid": "c828af7f-2c18-4087-b723-33bdd3812edf",
                "description": "Servers hosting SDN controllers must have logging enabled.",
                "control-id": "au-3.(2)"
              }
            ]
          },
          {
            "uuid": "3f4c5164-9e75-461c-be45-13c27d1483c8",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-6..",
            "implemented-requirements": [
              {
                "uuid": "1a9f4ebe-4f65-48ca-aa61-f70cab3b92b2",
                "description": "Southbound API control plane traffic must traverse an out-of-band path or be encrypted using a FIPS-validated cryptographic module.\nNorthbound API traffic must traverse an out-of-band path or be encrypted using a FIPS-validated cryptographic module.\nSouthbound API management plane traffic for provisioning and configuring virtual network elements within the SDN infrastructure must traverse an out-of-band path or be encrypted using a using a FIPS-validated cryptographic module.\nSouthbound API management plane traffic for configuring SDN parameters on physical network elements must be encrypted using a FIPS-validated cryptographic module.\nPhysical SDN controllers and servers hosting SDN applications must reside within the management network with multiple paths that are secured by a firewall to inspect all ingress traffic.\nSDN-enabled routers and switches must provide link state information to the SDN controller to create new forwarding decisions for the network elements.\nQuality of service (QoS) must be implemented on the underlying IP network to provide preferred treatment for traffic between the SDN controllers and SDN-enabled switches and hypervisors.\nSDN controllers must be deployed as clusters and on separate physical hosts to eliminate single point of failure.\nPhysical devices hosting an SDN controller must be connected to two switches for high-availability.\nSDN-enabled routers and switches must rate limit the amount of unknown data plane packets that are punted to the SDN controller.\nAll Virtual Extensible Local Area Network (VXLAN) enabled switches must be configured with the appropriate VXLAN network identifier (VNI) to ensure VMs can send and receive all associated traffic for their Layer 2 domain.\nVirtual Extensible Local Area Network (VXLAN) identifiers must be mapped to the appropriate VLAN identifiers.\nThe proper multicast group for each Virtual Extensible Local Area Network (VXLAN) identifier must be mapped to the appropriate virtual tunnel endpoint (VTEP) so the VTEP will join the associated multicast groups.\nThe virtual tunnel endpoint (VTEP) must be dual-homed to two physical network nodes.\nA secondary IP address must be specified for the virtual tunnel endpoint (VTEP) loopback interface when Virtual Extensible Local Area Network (VXLAN) enabled switches are deployed as a multi-chassis configuration.\nTwo or more edge gateways must be deployed connecting the network virtualization platform (NVP) and the physical network.\nVirtual edge gateways must be deployed across multiple hypervisor hosts.\nThe virtual edge gateways must be deployed with routing adjacencies established with two or more physical routers.",
                "control-id": "cm-6."
              }
            ]
          },
          {
            "uuid": "9aa78ca1-ba36-486f-be82-d62d8121147d",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-5.(2).",
            "implemented-requirements": [
              {
                "uuid": "ca3b1e0b-80b8-4de6-9467-bb43fa565056",
                "description": "Access to the SDN management and orchestration systems must be authenticated using a FIPS-approved message authentication code algorithm.\nSouthbound API management plane traffic for provisioning and configuring virtual network elements within the SDN infrastructure must be authenticated using a FIPS-approved message authentication code algorithm.\nSouthbound API management plane traffic for configuring SDN parameters on physical network elements must be authenticated using DOD PKI certificate-based authentication.",
                "control-id": "ia-5.(2)"
              }
            ]
          },
          {
            "uuid": "ef929607-1192-48f3-bf6b-3d00df8040e1",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-7..",
            "implemented-requirements": [
              {
                "uuid": "83fd2365-63ce-4bfc-9f6e-8e442aec86e2",
                "description": "Southbound API control plane traffic between the SDN controller and SDN-enabled network elements must be mutually authenticated using a FIPS-approved message authentication code algorithm.\nNorthbound API traffic received by the SDN controller must be authenticated using a FIPS-approved message authentication code algorithm.",
                "control-id": "ia-7."
              }
            ]
          },
          {
            "uuid": "8cac2ffc-e24f-459e-8f82-f580f43a0e71",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement si-4..",
            "implemented-requirements": [
              {
                "uuid": "51abd216-73b9-4dcf-be1d-7fcb5a287182",
                "description": "Servers hosting SDN controllers must have an HIDS implemented to detect unauthorized changes.",
                "control-id": "si-4."
              }
            ]
          }
        ]
      }
    ]
  }
}