{
  "component-definition": {
    "uuid": "039440a8-11e3-4158-b32d-153fb7efe1d8",
    "metadata": {
      "title": "VMWare vSphere 6-5 Y21M10",
      "last-modified": "2022-06-10T12:50:54",
      "version": "2022-06-10T12:50:54",
      "oscal-version": "1.0.0",
      "parties": [
        {
          "uuid": "f1b5d9c4-a469-49e4-aad6-ac8fe646d0a4",
          "type": "organization",
          "name": "Example Organization"
        }
      ]
    },
    "components": [
      {
        "uuid": "63c7d665-d386-4748-b0a7-9226313b13c5",
        "type": "software",
        "title": "VMWare vSphere 6-5 Y21M10",
        "description": "Tempora etincidunt sed quisquam.",
        "responsible-roles": [
          {
            "role-id": "supplier",
            "party-uuids": [
              "f1b5d9c4-a469-49e4-aad6-ac8fe646d0a4"
            ]
          }
        ],
        "props": [],
        "control-implementations": [
          {
            "uuid": "36519ab7-113e-4132-840e-c7b442339ccf",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-7..",
            "implemented-requirements": [
              {
                "uuid": "170f7714-abc6-4480-aec3-6d87a076b6a9",
                "description": "The ESXi host must enforce the unlock timeout of 15 minutes after a user account is locked out.",
                "control-id": "ac-7."
              },
              {
                "uuid": "c16c6a93-1923-46af-a43c-7e751dc44f46",
                "description": "The ESXi host must enforce the limit of three consecutive invalid logon attempts by a user.",
                "control-id": "ac-7."
              }
            ]
          },
          {
            "uuid": "bc0a0ebf-eb96-4a40-9131-6f65d5ac7fc3",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-8..",
            "implemented-requirements": [
              {
                "uuid": "87e2649f-ca31-45e1-a819-2c1f9978c2fb",
                "description": "The ESXi host must display the Standard Mandatory DoD Notice and Consent Banner before granting access to the system.\nThe ESXi host must display the Standard Mandatory DoD Notice and Consent Banner before granting access to the system.\nThe ESXi host SSH daemon must be configured with the Department of Defense (DoD) login banner.",
                "control-id": "ac-8."
              }
            ]
          },
          {
            "uuid": "7d6e69fd-07f7-41f6-87eb-bab210128afa",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-10..",
            "implemented-requirements": [
              {
                "uuid": "5b034916-6c3b-489f-8cd0-f930f5bbed4d",
                "description": "The ESXi host must limit the number of concurrent sessions to ten for all accounts and/or account types by enabling lockdown mode.",
                "control-id": "ac-10."
              }
            ]
          },
          {
            "uuid": "add00490-d774-4172-92e2-4a8799c03b64",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-17.(1).",
            "implemented-requirements": [
              {
                "uuid": "fecdf44e-c5fb-4005-b9d0-b58dfe39325e",
                "description": "Remote logging for ESXi hosts must be configured.",
                "control-id": "ac-17.(1)"
              }
            ]
          },
          {
            "uuid": "ee4f41ac-1390-4257-8503-cc8401fedd77",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ac-17.(2).",
            "implemented-requirements": [
              {
                "uuid": "835a2090-31c0-4170-a1f7-0d2bddaafd1a",
                "description": "The ESXi host SSH daemon must use DoD-approved encryption to protect the confidentiality of remote access sessions.\nThe ESXi host SSH daemon must be configured to use only the SSHv2 protocol.",
                "control-id": "ac-17.(2)"
              }
            ]
          },
          {
            "uuid": "46dd47f7-6da5-4631-a606-afbd796bec75",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-3..",
            "implemented-requirements": [
              {
                "uuid": "fdf2d005-a00c-4ba4-af16-0d70f9bfcd31",
                "description": "The ESXi host must produce audit records containing information to establish what type of events occurred.",
                "control-id": "au-3."
              }
            ]
          },
          {
            "uuid": "bc1480b5-1dbd-44b6-b09a-289fcf7cfd9a",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-4..",
            "implemented-requirements": [
              {
                "uuid": "6b3aba49-efe0-4222-a3df-5bb9136e58fa",
                "description": "The ESXi host must enable a persistent log location for all locally stored logs.",
                "control-id": "au-4."
              }
            ]
          },
          {
            "uuid": "9d3afa26-c051-495b-bca7-c7f60fa21180",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement au-8.(1).",
            "implemented-requirements": [
              {
                "uuid": "2db4d050-770a-4700-9dc0-66c5c1428df5",
                "description": "The ESXi host must configure NTP time synchronization.",
                "control-id": "au-8.(1)"
              }
            ]
          },
          {
            "uuid": "1ac81a33-ba23-422c-9fc6-bfdba5dec3f1",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-5.(3).",
            "implemented-requirements": [
              {
                "uuid": "05692cde-5c72-4297-9a7b-38e71ee0ef35",
                "description": "The ESXi Image Profile and VIB Acceptance Levels must be verified.",
                "control-id": "cm-5.(3)"
              }
            ]
          },
          {
            "uuid": "ae0197cb-9ef0-4cfc-a75d-10f6ab7311fa",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-6..",
            "implemented-requirements": [
              {
                "uuid": "c2420cc6-802b-43cd-b118-0579ee3be8f4",
                "description": "The ESXi host must verify the DCUI.Access list.\nThe ESXi host must verify the exception users list for lockdown mode.\nThe ESXi host SSH daemon must not allow host-based authentication.\nThe ESXi host SSH daemon must not permit root logins.\nThe ESXi host SSH daemon must not allow authentication using an empty password.\nThe ESXi host SSH daemon must not permit user environment settings.\nThe ESXi host SSH daemon must be configured to only use Message Authentication Codes (MACs) employing FIPS 140-2 approved cryptographic hash algorithms.\nThe ESXi host SSH daemon must not permit GSSAPI authentication.\nThe ESXi host SSH daemon must not permit Kerberos authentication.\nThe ESXi host SSH daemon must perform strict mode checking of home directory configuration files.\nThe ESXi host SSH daemon must not allow compression or must only allow compression after successful authentication.\nThe ESXi host SSH daemon must be configured to not allow gateway ports.\nThe ESXi host SSH daemon must be configured to not allow X11 forwarding.\nThe ESXi host SSH daemon must not accept environment variables from the client.\nThe ESXi host SSH daemon must not permit tunnels.\nThe ESXi host SSH daemon must set a timeout count on idle sessions.\nThe ESXi hostSSH daemon must set a timeout interval on idle sessions.\nThe ESXi host SSH daemon must limit connections to a single session.\nThe ESXi host must remove keys from the SSH authorized_keys file.\nThe password hashes stored on the ESXi host must have been generated using a FIPS 140-2 approved cryptographic hashing algorithm.\nSNMP must be configured properly on the ESXi host.\nThe ESXi host must enable bidirectional CHAP authentication for iSCSI traffic.\nThe ESXi host must disable Inter-VM transparent page sharing.\nThe ESXi host must configure the firewall to restrict access to services running on the host.\nThe ESXi host must configure the firewall to block network traffic by default.\nThe ESXi host must enable BPDU filter on the host to prevent being locked out of physical switch ports with Portfast and BPDU Guard enabled.\nThe virtual switch Forged Transmits policy must be set to reject on the ESXi host.\nThe virtual switch MAC Address Change policy must be set to reject on the ESXi host.\nThe virtual switch Promiscuous Mode policy must be set to reject on the ESXi host.\nThe ESXi host must prevent unintended use of the dvFilter network APIs.\nFor the ESXi host all port groups must be configured to a value other than that of the native VLAN.\nFor the ESXi host all port groups must not be configured to VLAN 4095 unless Virtual Guest Tagging (VGT) is required.\nFor the ESXi host all port groups must not be configured to VLAN values reserved by upstream physical switches.\nFor physical switch ports connected to the ESXi host, the non-negotiate option must be configured for trunk links between external physical switches and virtual switches in VST mode.\nAll ESXi host-connected physical switch ports must be configured with spanning tree disabled.\nAll ESXi host-connected virtual switch VLANs must be fully documented and have only the required VLANs.\nThe ESXi host must not provide root/administrator level access to CIM-based hardware monitoring tools or other third-party applications.\nThe ESXi host must verify the integrity of the installation media before installing ESXi.\nThe ESXi host must have all security patches and updates installed.\nThe ESXi host must enable Secure Boot.\nThe ESXi host must use DoD-approved certificates.",
                "control-id": "cm-6."
              }
            ]
          },
          {
            "uuid": "85518494-f027-4d88-8b35-0060ecee0214",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement cm-7..",
            "implemented-requirements": [
              {
                "uuid": "c36910d6-1cad-4e74-aeb0-59d468ad4357",
                "description": "The ESXi host must disable the Managed Object Browser (MOB).\nThe ESXi host must be configured to disable non-essential capabilities by disabling SSH.\nThe ESXi host must disable ESXi Shell unless needed for diagnostics or troubleshooting.",
                "control-id": "cm-7."
              }
            ]
          },
          {
            "uuid": "6eed519f-8196-43ef-bbc2-511eb1a7f2c5",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-2..",
            "implemented-requirements": [
              {
                "uuid": "f0fa453b-e7dd-40e8-be51-8cddb41dc6df",
                "description": "The ESXi host must use Active Directory for local user authentication.\nThe ESXi host must use the vSphere Authentication Proxy to protect passwords when adding ESXi hosts to Active Directory.\nActive Directory ESX Admin group membership must not be used when adding ESXi hosts to Active Directory.",
                "control-id": "ia-2."
              }
            ]
          },
          {
            "uuid": "d3f682ea-d2ce-41f9-85f0-012f25bd7a3c",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-2.(3).",
            "implemented-requirements": [
              {
                "uuid": "30607676-6e3b-4763-828e-a6ef840b6ff4",
                "description": "The ESXi host SSH daemon must ignore .rhosts files.\nThe ESXi host must use multifactor authentication for local access to privileged accounts.",
                "control-id": "ia-2.(3)"
              }
            ]
          },
          {
            "uuid": "0dea9280-cead-4dca-b76a-903781a30b9a",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-2.(5).",
            "implemented-requirements": [
              {
                "uuid": "b048edb3-3946-479d-9e00-3b199c3243e5",
                "description": "The ESXi host must require individuals to be authenticated with an individual authenticator prior to using a group authenticator by using Active Directory for local user authentication.",
                "control-id": "ia-2.(5)"
              }
            ]
          },
          {
            "uuid": "f393bd2f-91ac-40a8-b60f-61dcd2682ed7",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement ia-5.(1).",
            "implemented-requirements": [
              {
                "uuid": "eb13d217-8704-42ef-9b87-951b46693b45",
                "description": "The ESXi host must prohibit the reuse of passwords within five iterations.",
                "control-id": "ia-5.(1)"
              },
              {
                "uuid": "1d586e0f-343f-4514-8c51-6366a11dd8da",
                "description": "The ESXi host  must enforce password complexity by requiring that at least one upper-case character be used.",
                "control-id": "ia-5.(1)"
              }
            ]
          },
          {
            "uuid": "062f1d33-ea5d-4909-a363-01dbc925189c",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-8..",
            "implemented-requirements": [
              {
                "uuid": "93c53cbc-14bc-44fa-9a2d-3840c91845b5",
                "description": "The ESXi host must protect the confidentiality and integrity of transmitted information by isolating vMotion traffic.\nThe ESXi host must protect the confidentiality and integrity of transmitted information by protecting IP based management traffic.\nThe ESXi host must protect the confidentiality and integrity of transmitted information by utilizing different TCP/IP stacks where possible.\nThe ESXi host must protect the confidentiality and integrity of transmitted information.",
                "control-id": "sc-8."
              }
            ]
          },
          {
            "uuid": "38d89a9c-dffd-4fea-8282-20639a77bcd3",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-10..",
            "implemented-requirements": [
              {
                "uuid": "6e59372f-8771-4e69-a5c2-849daa3517ea",
                "description": "The ESXi host must set a timeout to automatically disable idle sessions after 10 minutes.\nThe ESXi host must terminate shell services after 10 minutes.\nThe ESXi host must logout of the console UI after 10 minutes.",
                "control-id": "sc-10."
              }
            ]
          },
          {
            "uuid": "2fedd064-8f18-4217-92fc-60173683f462",
            "source": "NIST_SP-800-53_rev4",
            "description": "This is a partial implementation of the NIST_SP-800-53_rev4 catalog, focusing on the control enhancement sc-24..",
            "implemented-requirements": [
              {
                "uuid": "3cbf9559-81b4-4f31-94ce-f189d7ce5aa2",
                "description": "The ESXi host must enable kernel core dumps.",
                "control-id": "sc-24."
              }
            ]
          }
        ]
      }
    ]
  }
}